Tekla.Structures.ModelInternal.BuildingHierarchy.Site
Class for Building Hierarchy Site

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.Description
Gets or sets the Description of the Site.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.BuildingHierarchy.Site class.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.GetBuildings
Gets all buildings belonging to this site.
Returns: All buildings belonging to this site.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.GetSpaces
Gets all spaces belonging to this site.
Returns: All spaces belonging to this site.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.Insert
Inserts this Building Hierarchy object into model database. All the attributes must be set.
Returns: True if the object was successfully inserted.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.Select
Selects the Building Hierarchy object from model database. The object identifier must be set.
Returns: True if the object was successfully selected.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.Modify
Modifies the existing Building Hierarchy object in the model database to match the current one.
Returns: True if the object was successfully modified.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.Delete
Deletes the Building Hierarchy object instance with the given identifier from the model database.
Returns: True if the object was successfully deleted.

Tekla.Structures.ModelInternal.BuildingHierarchy.Site.GetBHType
